#ifndef  __BS08S_HW_CFG_H
#define  __BS08S_HW_CFG_H

#include "DataType/DataType.h"

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************************
 * 硬件配置接口
 ****************************************************************************/

/**
  * @brief  系统硬件初始化
  * @param  None
  * @retval None
  */
void BS08S_HwInit(void);


/*****************************************************************************
 * 主线程LED显示接口
 ****************************************************************************/

/**
  * @brief  LED 流水灯循环
  * @param  None
  * @retval None
  */
void BS08S_MainWorkLedShow(void);


/*****************************************************************************
 * 温度传感器数据处理线程接口
 ****************************************************************************/

/**
  * @brief  温度传感器数据处理线程
  * @param  None
  * @retval None
  */
void BS08S_SensorSampleProc(void);


#ifdef __cplusplus
}
#endif


#endif /* __BS08S_HW_CFG_H */
