/**
  ******************************************************************************
  * @file    HAL_Watchdog.c
  * @author  Duhanfneg
  * @version V1.0
  * @date    2017.07.21
  * @brief   C_CAN drivers
  ******************************************************************************
  * @attention
  * 
  * 引脚,
  *     CAN1_TD  --- P0_1(Fun1),  P0_22(Fun3),
  *     CAN1_RD  --- P0_0(Fun1),  P0_21(Fun3),
  *                  
  *     CAN2_TD  --- P0_5(Fun2),  P2_8(Fun1),
  *     CAN2_RD  --- P0_4(Fun2),  P2_7(Fun1),
  * 
  * 
  *  
  ******************************************************************************
  */
  
/***********************************<INCLUDES>**********************************/
#include "HAL_Watchdog.h"
#include "DataType/DataType.h"
#include "HwDrivers/HW_WatchDog.h"


/*****************************************************************************
 * 私有成员定义及实现
 ****************************************************************************/


/*****************************************************************************
 * WatchDog 基本功能接口
 ****************************************************************************/

/**
  * @brief  看门狗启动
  * @param  ulTimeOutMs 超时时间
  * @retval None
  * @note   看门狗一旦开启,就无法停止
  */
void HAL_WWDT_Start(uBit32 ulTimeOutMs)
{
    HW_WWDT_Start(ulTimeOutMs);
    
}


/**
  * @brief  喂狗
  * @param  None
  * @retval None
  */
void HAL_WWDT_Feed(void)
{
    HW_WWDT_Feed();
    
}

