/**
  ******************************************************************************
  * @file    main.c
  * @author  Duhanfneg
  * @version V1.0
  * @date    2017.11.07
  * @brief   
  ******************************************************************************
  * @attention
  * 
  * 通用控制平台程序入口
  * 
  * 
  ******************************************************************************
  */
  
/***********************************<INCLUDES>**********************************/
#include "SysCtrl/SYS_Init.h"
#include "Application/Application.h"

int main(void)
{
    SYS_Init(); //系统初始化
    
    APP_Init(); //APP初始化

    while(1)
    {
        //系统内部管理
        SYS_MainTaskHandler();
        
        //应用逻辑管理
        APP_MainProc();
    }
    
} 

