#ifndef  __CN_HW_CFG_H
#define  __CN_HW_CFG_H

#include "DataType/DataType.h"

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************************
 * 硬件配置接口
 ****************************************************************************/

/**
  * @brief  系统硬件初始化
  * @param  None
  * @retval None
  */
void CN_HwInit(void);


/*****************************************************************************
 * 主线程LED显示接口
 ****************************************************************************/

/**
  * @brief  LED 流水灯循环
  * @param  None
  * @retval None
  */
void CN_MainWorkLedShow(void);


/*****************************************************************************
 * 按键处理线程接口
 ****************************************************************************/

/**
  * @brief  按键处理
  * @param  None
  * @retval None
  */
void CN_KeyProc(void);



/*****************************************************************************
 * 温度采集线程接口
 ****************************************************************************/

/**
  * @brief  温度数据采集
  * @param  None
  * @retval None
  */
void CN_SamplingTempValue(void);


/**
  * @brief  温度采集数据获取
  * @param  None
  * @retval 采集到的温度数据(原始AD值,未作转换)
  */
uBit32 CN_GetTempSamplingValue(void);



#ifdef __cplusplus
}
#endif


#endif /* __CN_HW_CFG_H */
