#ifndef  __BS04_HW_CFG_H
#define  __BS04_HW_CFG_H

#include "DataType/DataType.h"

#ifdef __cplusplus
extern "C" {
#endif

/*****************************************************************************
 * 硬件配置接口
 ****************************************************************************/

/**
  * @brief  系统硬件初始化
  * @param  None
  * @retval None
  */
void BS04_HwInit(void);


/*****************************************************************************
 * 主线程LED显示接口
 ****************************************************************************/

/**
  * @brief  LED 流水灯循环
  * @param  None
  * @retval None
  */
void BS04_ShowMainWorkLed(void);


/*****************************************************************************
 * 蜂鸣器管理线程接口
 ****************************************************************************/

/**
  * @brief  蜂鸣器使能
  * @param  None
  * @retval None
  */
void BS04_BeepEnable(void);


/**
  * @brief  蜂鸣器管理
  * @param  None
  * @retval None
  */
void BS04_Handler(void);


/*****************************************************************************
 * 人体红外探测线程接口
 ****************************************************************************/

/**
  * @brief  人体检测线程
  * @param  None
  * @retval None
  */
void BS04_HumanDetectHandler(void);

/*****************************************************************************
 * 红外遥控接收线程接口
 ****************************************************************************/

/**
  * @brief  红外遥控接收初始化
  * @param  None
  * @retval None
  */
void BS04_InitIR(void);


/**
  * @brief  红外遥控接收处理
  * @param  None
  * @retval None
  */
void BS04_IRHandler(void);


#ifdef __cplusplus
}
#endif


#endif /* __BS04_HW_CFG_H */
