/**
  ******************************************************************************
  * @file    SYS_CncConfig.c
  * @author  Duhanfneg
  * @version V1.0
  * @date    2017.12.05
  * @brief   System cnc module initialize
  ******************************************************************************
  * @attention
  * 
  * 
  * 
  * 
  ******************************************************************************
  */
  
/***********************************<INCLUDES>**********************************/
#include "SYS_CncConfig.h"
#include "DataType/DataType.h"
#include "CNC/CNCSYS/CNCSYS_Interface.h"

#include "SysPeripheral/IRQ/IRQ_Man.h"

/*****************************************************************************
 * 私有成员定义及实现
 ****************************************************************************/


/*****************************************************************************
 * CNC相关控制接口
 ****************************************************************************/


/**
  * @brief  CNC初始化
  * @param  None
  * @retval 0-成功 非0-失败
  */
uBit32 SYS_InitCNC(void)
{
    CNCSYS_Init();
    
    IRQ_SetTrgCallback(CNCSYS_IPOInSysTick, IRQ_TRG_SYSTICK_OS);
      
    return 0;
}