/**
  ******************************************************************************
  * @file    Watchdog.c
  * @author  Duhanfneg
  * @version V1.0
  * @date    2017.11.26
  * @brief   Watchdog application
  ******************************************************************************
  * @attention
  * 
  * 
  * 
  * 
  ******************************************************************************
  */
  
/***********************************<INCLUDES>**********************************/
#include "Watchdog.h"
#include "DataType/DataType.h"
#include "HAL/HAL_Watchdog.h"

/*****************************************************************************
 * 私有成员定义及实现
 ****************************************************************************/


/*****************************************************************************
 * WatchDog 相关控制接口
 ****************************************************************************/

/**
  * @brief  看门狗启动
  * @param  ulTimeOutMs 超时时间
  * @retval None
  * @note   看门狗一旦开启,就无法停止
  */
void WWDT_Start(uBit32 ulTimeOutMs)
{
    HAL_WWDT_Start(ulTimeOutMs);
    
}


/**
  * @brief  喂狗
  * @param  None
  * @retval None
  */
void WWDT_Feed(void)
{
    HAL_WWDT_Feed();
    
}
